rest/target/classes/Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/
                                      http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getPerson xmlns="http://spring.io/guides/gs-producing-web-service">
            <gs:person>
                <age>16</age>
                <firstName>Edward</firstName>
                <lastName>Elric</lastName>
                <nickName>Full Metal</nickName>
            </gs:person>
        </gs:getPerson>
    </soapenv:Body>
</soapenv:Envelope>